In [7]:
import sqlite3

import pandas as pd

In [8]:
con = sqlite3.connect('vbo.db')

In [9]:
?con

Call signature: con(*args, **kwargs)
Type:           Connection
String form:    <sqlite3.Connection object at 0x000002536265AB90>
File:           c:\users\sefa3\anaconda3\lib\sqlite3\__init__.py
Docstring:      SQLite database connection object.

In [10]:
# SQL tarafındaki sorguları çalıştırmak için kullanacağımız bir ifade 'cursor'

c = con.cursor()

In [11]:
?c

Type:        Cursor
String form: <sqlite3.Cursor object at 0x00000253626EB1F0>
File:        c:\users\sefa3\anaconda3\lib\sqlite3\__init__.py
Docstring:   SQLite database cursor class.

In [12]:
?pd.read_sql

Signature:
pd.read_sql(
    sql,
    con,
    index_col=None,
    coerce_float=True,
    params=None,
    parse_dates=None,
    columns=None,
    chunksize=None,
)
Docstring:
Read SQL query or database table into a DataFrame.

This function is a convenience wrapper around ``read_sql_table`` and
``read_sql_query`` (for backward compatibility). It will delegate
to the specific function depending on the provided input. A SQL query
will be routed to ``read_sql_query``, while a database table name will
be routed to ``read_sql_table``. Note that the delegated function might
have more specific notes about their functionality not listed here.

Parameters
----------
sql : string or SQLAlchemy Selectable (select or text object)
    SQL query to be executed or a table name.
con : SQLAlchemy connectable (engine/connection) or database string URI
    or DBAPI2 connection (fallback mode)

    Using SQLAlchemy makes it possible to use any DB supported by that
    library. If a DBAPI2 object, only sqlite3 is supported.
index_col : string or list of strings, optional, default: None
    Column(s) to set as index(MultiIndex).
coerce_float : boolean, default True
    Attempts to convert values of non-string, non-numeric objects (like
    decimal.Decimal) to floating point, useful for SQL result sets.
params : list, tuple or dict, optional, default: None
    List of parameters to pass to execute method.  The syntax used
    to pass parameters is database driver dependent. Check your
    database driver documentation for which of the five syntax styles,
    described in PEP 249's paramstyle, is supported.
    Eg. for psycopg2, uses %(name)s so use params={'name' : 'value'}
parse_dates : list or dict, default: None
    - List of column names to parse as dates.
    - Dict of ``{column_name: format string}`` where format string is
      strftime compatible in case of parsing string times, or is one of
      (D, s, ns, ms, us) in case of parsing integer timestamps.
    - Dict of ``{column_name: arg dict}``, where the arg dict corresponds
      to the keyword arguments of :func:`pandas.to_datetime`
      Especially useful with databases without native Datetime support,
      such as SQLite.
columns : list, default: None
    List of column names to select from SQL table (only used when reading
    a table).
chunksize : int, default None
    If specified, return an iterator where `chunksize` is the
    number of rows to include in each chunk.

Returns
-------
DataFrame

See Also
--------
read_sql_table : Read SQL database table into a DataFrame.
read_sql_query : Read SQL query into a DataFrame.
File:      c:\users\sefa3\anaconda3\lib\site-packages\pandas\io\sql.py
Type:      function

## read_sql

In [13]:
pd.read_sql("SELECT COUNT(CustomerID) AS MUSTERI_SAYISI, Country FROM Customers GROUP BY Country", con)

    MUSTERI_SAYISI      Country
0                3    Argentina
1                2      Austria
2                2      Belgium
3                9       Brazil
4                3       Canada
5                2      Denmark
6                2      Finland
7               11       France
8               11      Germany
9                1      Ireland
10               3        Italy
11               5       Mexico
12               1       Norway
13               1       Poland
14               2     Portugal
15               5        Spain
16               2       Sweden
17               2  Switzerland
18               7           UK
19              13          USA
20               4    Venezuela

In [14]:
pd.read_sql("""
SELECT COUNT(CustomerID) AS MUSTERI_SAYISI, Country 
FROM Customers GROUP BY Country
""", con)

    MUSTERI_SAYISI      Country
0                3    Argentina
1                2      Austria
2                2      Belgium
3                9       Brazil
4                3       Canada
5                2      Denmark
6                2      Finland
7               11       France
8               11      Germany
9                1      Ireland
10               3        Italy
11               5       Mexico
12               1       Norway
13               1       Poland
14               2     Portugal
15               5        Spain
16               2       Sweden
17               2  Switzerland
18               7           UK
19              13          USA
20               4    Venezuela

In [15]:
ab = pd.read_sql("""
SELECT COUNT(CustomerID) AS MUSTERI_SAYISI, Country 
FROM Customers GROUP BY Country
""", con)

In [16]:
ab

    MUSTERI_SAYISI      Country
0                3    Argentina
1                2      Austria
2                2      Belgium
3                9       Brazil
4                3       Canada
5                2      Denmark
6                2      Finland
7               11       France
8               11      Germany
9                1      Ireland
10               3        Italy
11               5       Mexico
12               1       Norway
13               1       Poland
14               2     Portugal
15               5        Spain
16               2       Sweden
17               2  Switzerland
18               7           UK
19              13          USA
20               4    Venezuela

In [24]:
ab.head()

   MUSTERI_SAYISI    Country
0               3  Argentina
1               2    Austria
2               2    Belgium
3               9     Brazil
4               3     Canada

In [17]:
type(ab)

pandas.core.frame.DataFrame

## con_close()

In [22]:
c.execute("SELECT CustomerName FROM Customers LIMIT 5")

In [19]:
c.fetchone()

('Alfreds Futterkiste',)

In [20]:
c.fetchall()

[('Ana Trujillo Emparedados y helados',),
 ('Antonio Moreno Taquería',),
 ('Around the Horn',),
 ('Berglunds snabbköp',)]

In [23]:
for row in c.execute("SELECT CustomerName FROM Customers LIMIT 5", ''):
    print(row)

('Alfreds Futterkiste',)
('Ana Trujillo Emparedados y helados',)
('Antonio Moreno Taquería',)
('Around the Horn',)
('Berglunds snabbköp',)